In [4]:
import mysql.connector

In [5]:
Adb = mysql.connector.connect(
    user='mysqluser',
    password='*7E567C9DC06217268D72D52BABCA14EAB8993ACF',
    host='104.237.2.219',
    port='5340',
    database='retail'
)

In [8]:
newdb = Adb.cursor()

newdb.execute("create database Colg_database")

print("Database has been succesfully created")

Database has been succesfully created

In [9]:
newdb.execute("use Colg_database")
print("Database is in Use")

Database is in Use

In [10]:
newdb.execute("""
            Create Table stud_table (
              stud_ID INT Primary Key Auto_increment,
              stud_name VARCHAR (30),
              age INT,
              dep_ID INT
)""")

print("Student table created")

Student table created

In [11]:
newdb.execute("""
                create Table course_table(
                course_id INT PRIMARY KEY,
                course_name VARCHAR(100),
                professor_id INT
)""")
print("Course table created")

Course table created

In [12]:
newdb.execute("""
                CREATE TABLE Professors (
                professor_id INT PRIMARY KEY,
                Prof_name VARCHAR(50),
                department_id INT
)""")
print("Course table created")

Course table created

In [14]:
drop_table="""drop Table Professors"""
newdb.execute(drop_table)
print("Table has been dropped")

Table has been dropped

In [15]:
drop_table1="""drop Table course_table"""
newdb.execute(drop_table1)
print("Table has been dropped")

Table has been dropped

In [16]:
newdb.execute("""
                create Table course_table(
                course_id INT PRIMARY KEY,
                course_name VARCHAR(100),
                stud_ID INT,
               foreign key (stud_ID) References stud_table (stud_ID)
)""")
print("Course table created")

Course table created

In [17]:
Students = [
("sai",21,1),
 ("Charan",22,1),
 ("Varun",24,2),
 ("krishna",22,2),
 ("Bhavana",21,2),
 ("Jagan",21,3),
 ("Vishnu",21,1),
 ("Veda",21,3),
 ("Surya",21,3)
]
for stud in Students:
    newdb.execute("insert into stud_table (stud_name,age,dep_id) Values (%s,%s,%s)",stud)
Adb.commit()
print("Student values inserted")

Student values inserted

In [20]:
Courses= [(1,"HR",1),(2,"Marketing",2),(3,"Sales",1),(4,"Product",2),(5,"Project",3)]
for cou in Courses:
    newdb.execute("Insert into course_table (course_ID,course_Name,stud_ID) values (%s,%s,%s)" ,cou)
Adb.commit()
print("Courses Inserted")

Courses Inserted

In [21]:
show_table1 = """SELECT *from stud_table"""
newdb.execute(show_table1)
ss = newdb.fetchall()
for s in ss:
    print(s)

(1, 'sai', 21, 1)
(2, 'Charan', 22, 1)
(3, 'Varun', 24, 2)
(4, 'krishna', 22, 2)
(5, 'Bhavana', 21, 2)
(6, 'Jagan', 21, 3)
(7, 'Vishnu', 21, 1)
(8, 'Veda', 21, 3)
(9, 'Surya', 21, 3)

In [22]:
show_table2 = """SELECT *from course_table"""
newdb.execute(show_table2)
YY = newdb.fetchall()
for y in YY:
    print(y)

(1, 'HR', 1)
(2, 'Marketing', 2)
(3, 'Sales', 1)
(4, 'Product', 2)
(5, 'Project', 3)

In [30]:
drop_table = """drop Table stud_table"""
newdb.execute(drop_table)
print("Table has been dropped")

InternalError: Unread result found